%23.11.15 by sdy
% 旋转变换简单，位置变化 以默认方向标注
% 定义{SB}(Sensor Block)坐标系，其中心为定位球中心，坐标定义为 右下角 ←x，↑z坐标系
%thetas = Log(R^{O}_{SB}*R^{SB}_{S})
% 根据Datasheet默认的传感器方向， R^{SB}_{S}=[0,0,-1;-1,0,0;0,1,0];
% Optitrack能直接读到的R为R^{O}_{SB}

%23.11.13 by xpy
% 根据目标方向的不同可能需要改变函数中的R
% pos 表示需要定位的传感器在定位块上以右下角 ←x，↑z坐标系定义下的坐标
% T_rigid 表示传感器定位块在ground上的坐标变换
% 返回的T表示某个传感器在ground下的坐标变换

function T = T_sensor(T_rigid, id)
    sphere_r = 6.1;
    % 传感器定位块的变换矩阵
    %centroid_temp = ([10, 6.1, 8]' + [39, 6.1, 10]' + [40, 6.1, 70]')/3;%标定球质心相对于物块右下角的坐标（坐标系从SB）
    %posUatLocal= {[20,-8,0.16]',[25,-8,0.16]',[30,-8,0.16]',[29.718,-13,0.16]',[20,-3,0.16]',[25,-13,0.16]',[25,-3,0.16]',[30,-3,0.16]',[20,-13,0.16]'};
    centroid_temp = ([25,sphere_r,6]'+[3.5,sphere_r,4]'+[3.5,sphere_r,66.5]')/3;
    posUatLocal = {[24,0,26]',[24,0,38]',[24,0,50]',[24,0,62]',...
                              [18,0,26]',[18,0,38]',[18,0,50]',[18,0,62]',...
                              [12,0,26]',[12,0,38]',[12,0,50]',[12,0,62]',...
                              [6,0,26]',[6,0,38]',[6,0,50]',[6,0,62]'};
    
   % RU = [0,1,0;0,0,1;1,0,0];%[0,0,1;1,0,0;0,1,0];
    %posUatSB = RU*posUatLocal{id}+[68.1,0,14.9]'-centroid_temp;
    posUatSB = posUatLocal{id}-centroid_temp+[0,-0.5,0]';% + [3,-3,0]';

    %RSB_S = [0,-1,0;0,0,1;-1,0,0];
    RSB_S = [0,1,0;0,0,-1;-1,0,0];
    % traget_temp = [60, 0, 26.65]';
    %p = traget_temp - centroid_temp;
    %R = [[-1,0,0]',[0,0,1]',[0,1,0]'];
    T = T_rigid * [[RSB_S, posUatSB];[0,0,0,1]];
end

