% 旋转变换简单，位置变化 以默认方向标注
% 根据目标方向的不同可能需要改变函数中的R
% pos 表示需要定位的传感器在定位块上以右下角 ←x，↑z坐标系定义下的坐标
% T_rigid 表示传感器定位块在ground上的坐标变换
% 返回的T表示某个传感器在ground下的坐标变换

%3*3 [40,0,32.5] 4*4[25,0,32.5] 5*5[10,0,32.5]
%6*6 [40,0,17.5] 8*8[25,0,17.5] 10*10[10,0,17.5]
%1*3 [25,0,25]

% 8*8 [4,-7.5,12.43]

function T = T_small_magnet(T_rigid, pos)
    sphere_r = 6.1;
    centroid_temp = ([34, sphere_r, 8]' + [18, sphere_r, 42]' + [41, sphere_r, 43]')/3;
    traget_temp = pos;
    p = traget_temp - centroid_temp;
    % R = [[-1,0,0]',[0,0,1]',[0,1,0]'];
    R = [[0,0,1]',[0,1,0]',[-1,0,0]'];
    T = T_rigid * [[R, p];[0,0,0,1]];
end

